Revit 2027 API
WireframeBuilder.AddPoint Method
 Add a point to the shape representation stored in this WireframeBuilder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddPoint(
	Point GPoint
)
Public Sub AddPoint (
	GPoint As Point
)
public:
void AddPoint(
	Point^ GPoint
)
member AddPoint :
        GPoint : Point -> unit
Parameters
GPoint Point
 The point to be added.
Exceptions
Exception | Condition
ArgumentException |  GPoint is not acceptable for a wireframe shape representation.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WireframeBuilder Class
Autodesk.Revit.DB Namespace